NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/*
 * Copyright 2026, NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define ICR_IRQS_irqs0 0x00u      /*!<@brief Interrupt Select: Interrupt, trigger output, or DMA request 0 */
#define PCR_IBE_ibe0 0x00u        /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u        /*!<@brief Input Buffer Enable: Enables */
#define PORT5_PCR_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT0_14 (coord E11), SSD0_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD0_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD0_PERST_L_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD0_PERST_L_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD0_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD0_PERST_L_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD0_PERST_L_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_15 (coord G13), SSD1_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD1_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD1_PERST_L_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD1_PERST_L_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD1_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD1_PERST_L_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD1_PERST_L_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_18 (coord C10), SSD4_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD4_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD4_PERST_L_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD4_PERST_L_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD4_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD4_PERST_L_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD4_PERST_L_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_19 (coord C9), SSD2_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD2_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD2_PERST_L_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD2_PERST_L_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD2_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD2_PERST_L_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD2_PERST_L_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_23 (coord B7), SSD5_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_PERST_L_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_PERST_L_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_PERST_L_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_PERST_L_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_10 (coord C3), VPP_CPU1_ALERT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU1_ALERT_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_ALERT_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU1_ALERT_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU1_ALERT_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1_ALERT_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_ALERT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1_ALERT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT1_16 (coord F6), SSD0_PRSNT_L
  @{ */

