NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD0_PRSNT_L_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD0_PRSNT_L_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD0_PRSNT_L_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD0_PRSNT_L_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD0_PRSNT_L_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD0_PRSNT_L_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_17 (coord F4), SSD1_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD1_PRSNT_L_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD1_PRSNT_L_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD1_PRSNT_L_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD1_PRSNT_L_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD1_PRSNT_L_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD1_PRSNT_L_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_18 (coord G4), V_SSD5_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD5_DIS_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD5_DIS_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD5_DIS_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD5_DIS_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD5_DIS_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD5_DIS_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_19 (coord G5), V_SSD6_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD6_DIS_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD6_DIS_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD6_DIS_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD6_DIS_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD6_DIS_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD6_DIS_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_0 (coord H2), SSD4_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD4_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD4_PRSNT_L_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD4_PRSNT_L_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD4_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD4_PRSNT_L_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD4_PRSNT_L_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_1 (coord H1), SSD5_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_PRSNT_L_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_PRSNT_L_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_PRSNT_L_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_PRSNT_L_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_2 (coord H3), SSD6_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD6_PRSNT_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD6_PRSNT_L_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD6_PRSNT_L_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD6_PRSNT_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD6_PRSNT_L_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD6_PRSNT_L_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_8 (coord M2), SSD4_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD4_LED_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD4_LED_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD4_LED_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD4_LED_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD4_LED_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD4_LED_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_9 (coord M1), SSD5_LED
  @{ */

