NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_LED_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_LED_GPIO_PIN 9U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_LED_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_LED_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_LED_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_LED_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_10 (coord M3), SSD6_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD6_LED_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD6_LED_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD6_LED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD6_LED_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD6_LED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD6_LED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_11 (coord N4), SSD7_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD7_LED_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD7_LED_GPIO_PIN 11U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD7_LED_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD7_LED_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD7_LED_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD7_LED_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_0 (coord B17), SSD0_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD0_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD0_PWRDIS_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD0_PWRDIS_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD0_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD0_PWRDIS_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD0_PWRDIS_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_1 (coord C15), SSD1_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD1_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD1_PWRDIS_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD1_PWRDIS_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD1_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD1_PWRDIS_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD1_PWRDIS_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_6 (coord D17), SSD3_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD3_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD3_PWRDIS_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD3_PWRDIS_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD3_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD3_PWRDIS_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD3_PWRDIS_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_7 (coord D14), CLK_SSD2_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD2_EN_N_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD2_EN_N_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD2_EN_N_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD2_EN_N_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD2_EN_N_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD2_EN_N_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_8 (coord E14), SSD5_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD5_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD5_PWRDIS_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD5_PWRDIS_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD5_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD5_PWRDIS_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD5_PWRDIS_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                            /* @} */

