NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/*! @name PORT3_10 (coord F17), CLK_SSD3_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD3_EN_N_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD3_EN_N_GPIO_PIN 10U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD3_EN_N_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD3_EN_N_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD3_EN_N_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD3_EN_N_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT4_18 (coord N10), V_SSD2_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD2_DIS_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD2_DIS_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD2_DIS_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD2_DIS_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD2_DIS_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD2_DIS_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT4_20 (coord T10), V_SSD4_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD4_DIS_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD4_DIS_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD4_DIS_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD4_DIS_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD4_DIS_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD4_DIS_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT4_23 (coord U12), V_SSD7_DIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_V_SSD7_DIS_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_V_SSD7_DIS_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_V_SSD7_DIS_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_V_SSD7_DIS_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_V_SSD7_DIS_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_V_SSD7_DIS_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_20 (coord M17), VPP_CPU0_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU0_SDA_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0_SDA_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU0_SDA_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_21 (coord L16), VPP_CPU0_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU0_SCL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0_SCL_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU0_SCL_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_2 (coord C4), SSD7_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD7_PERST_L_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD7_PERST_L_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD7_PERST_L_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD7_PERST_L_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD7_PERST_L_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD7_PERST_L_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_7 (coord A2), CLK_SSD0_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD0_EN_N_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD0_EN_N_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD0_EN_N_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD0_EN_N_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD0_EN_N_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD0_EN_N_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_14 (coord D4), CLK_SSD1_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD1_EN_N_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD1_EN_N_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD1_EN_N_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD1_EN_N_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD1_EN_N_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD1_EN_N_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT1_15 (coord E4), SSD6_PWRDIS
  @{ */

