NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD6_PWRDIS_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD6_PWRDIS_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD6_PWRDIS_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD6_PWRDIS_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD6_PWRDIS_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD6_PWRDIS_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_9 (coord F15), SSD3_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD3_LED_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD3_LED_GPIO_PIN 9U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD3_LED_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD3_LED_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD3_LED_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD3_LED_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_11 (coord F16), SSD7_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD7_PWRDIS_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD7_PWRDIS_GPIO_PIN 11U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD7_PWRDIS_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD7_PWRDIS_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD7_PWRDIS_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD7_PWRDIS_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_13 (coord H16), VPP_CPU0_ALERT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU0_ALERT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0_ALERT_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU0_ALERT_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU0_ALERT_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU0_ALERT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0_ALERT_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU0_ALERT_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT3_16 (coord J15), SSD0_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD0_LED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD0_LED_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD0_LED_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD0_LED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD0_LED_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD0_LED_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_17 (coord K15), SSD4_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD4_PWRDIS_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD4_PWRDIS_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD4_PWRDIS_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD4_PWRDIS_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD4_PWRDIS_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD4_PWRDIS_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_18 (coord K16), SSD1_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD1_LED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD1_LED_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD1_LED_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD1_LED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD1_LED_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD1_LED_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_23 (coord M15), SSD2_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD2_LED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD2_LED_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD2_LED_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD2_LED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD2_LED_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD2_LED_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT4_3 (coord U1), V_SSD3_DIS
  @{ */

