NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/*! @name PORT5_3 (coord N11), PCIE_SSD3_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD3_PERST_L_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT5_2 (coord M10), PCIE_SSD4_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO GPIO5               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_PORT PORT5               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD4_PERST_L_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT4_14 (coord N8), PCIE_SSD5_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD5_PERST_L_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT4_16 (coord R8), PCIE_SSD6_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD6_PERST_L_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT4_17 (coord R9), PCIE_SSD7_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PCIE_SSD7_PERST_L_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT1_13 (coord D1), SMB_SSD6_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD6_SCL_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD6_SCL_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD6_SCL_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_12 (coord D2), SMB_SSD6_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD6_SDA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD6_SDA_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD6_SDA_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_25 (coord A6), SMB_SSD1_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD1_SCL_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD1_SCL_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD1_SCL_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_24 (coord B6), SMB_SSD1_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD1_SDA_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD1_SDA_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD1_SDA_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_22 (coord M16), VPP_CPU0B_ALERT
  @{ */

