NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_INIT_GPIO_VALUE 1U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU0B_ALERT_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT1_6 (coord B2), VPP_CPU1B_ALERT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1B_ALERT_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT1_20 (coord K5), SMB_SSD3_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD3_SDA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD3_SDA_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD3_SDA_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_21 (coord L5), SMB_SSD3_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD3_SCL_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD3_SCL_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD3_SCL_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_22 (coord L4), VMON_12V_SSD4_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD4_DIV_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD4_DIV_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD4_DIV_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT1_23 (coord M4), VMON_12V_SSD5_DIV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VMON_12V_SSD5_DIV_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VMON_12V_SSD5_DIV_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VMON_12V_SSD5_DIV_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PORT1_4 (coord A4), SMB_SSD4_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD4_SDA_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD4_SDA_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD4_SDA_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_5 (coord B3), SMB_SSD4_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD4_SCL_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD4_SCL_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD4_SCL_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_3 (coord J3), VPP_CPU1_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1_SCL_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_4 (coord K3), VPP_CPU1_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_VPP_CPU1_SDA_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_VPP_CPU1_SDA_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_VPP_CPU1_SDA_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT4_12 (coord T6), SMB_SSD2_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD2_SDA_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD2_SDA_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD2_SDA_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_13 (coord T7), SMB_SSD2_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD2_SCL_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD2_SCL_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD2_SCL_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_14 (coord H17), SMB_SSD5_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD5_SDA_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD5_SDA_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD5_SDA_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_15 (coord H15), SMB_SSD5_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD5_SCL_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD5_SCL_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD5_SCL_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_2 (coord D15), SMB_SSD0_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD0_SDA_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD0_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD0_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_3 (coord D16), SMB_SSD0_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD0_SCL_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD0_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD0_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_28 (coord E8), SSD3_PERST_L
  @{ */

