NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD3_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD3_PERST_L_GPIO_PIN 28U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD3_PERST_L_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD3_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD3_PERST_L_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD3_PERST_L_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_29 (coord F8), SSD6_PERST_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD6_PERST_L_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD6_PERST_L_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD6_PERST_L_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD6_PERST_L_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD6_PERST_L_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD6_PERST_L_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_4 (coord F14), SSD2_PWRDIS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD2_PWRDIS_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD2_PWRDIS_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD2_PWRDIS_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD2_PWRDIS_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD2_PWRDIS_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD2_PWRDIS_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_5 (coord G14), SSD45_PWRBRK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD45_PWRBRK_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD45_PWRBRK_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD45_PWRBRK_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD45_PWRBRK_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD45_PWRBRK_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD45_PWRBRK_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_19 (coord K17), SSD23_PWRBRK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD23_PWRBRK_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD23_PWRBRK_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD23_PWRBRK_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD23_PWRBRK_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD23_PWRBRK_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD23_PWRBRK_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_0 (coord P1), SSD7_PRSNT_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD7_PRSNT_L_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD7_PRSNT_L_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD7_PRSNT_L_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD7_PRSNT_L_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD7_PRSNT_L_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD7_PRSNT_L_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT4_1 (coord P2), CLK_SSD6_EN_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_CLK_SSD6_EN_N_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD6_EN_N_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_CLK_SSD6_EN_N_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_CLK_SSD6_EN_N_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_CLK_SSD6_EN_N_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_CLK_SSD6_EN_N_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_12 (coord G16), SSD01_PWRBRK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD01_PWRBRK_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD01_PWRBRK_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD01_PWRBRK_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD01_PWRBRK_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD01_PWRBRK_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD01_PWRBRK_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT1_11 (coord D3), SSD67_PWRBRK
  @{ */

