NVIDIA/OpenSMA/src/boards/p3957_cxx/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SSD67_PWRBRK_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SSD67_PWRBRK_GPIO_PIN 11U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_SSD67_PWRBRK_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SSD67_PWRBRK_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SSD67_PWRBRK_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SSD67_PWRBRK_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_6 (coord C14), MCU_RECOVERY
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MCU_RECOVERY_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_RECOVERY_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MCU_RECOVERY_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_4 (coord B14), SMB_SSD7_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD7_SDA_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD7_SDA_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD7_SDA_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT0_5 (coord A14), SMB_SSD7_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_SMB_SSD7_SCL_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SMB_SSD7_SCL_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SMB_SSD7_SCL_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
